{

    "Indicators": {
        "Price": {
            "Description" : "Moving Averages (MA) track price trends over many days. Price movement above or below MA's, along with the position of certain MA's can tell us the general direction of price movement. There are two basic types of MA's: Simple Moving Averages (SMA), which place equal weight on all prices in a timeframe, and Exponential Moving Averages (EMA), which place more emphasis on recent prices. ",
            "Notes" : "While MA's are generally safe indicators to use, MA's are heavily lagging indicators, so any flags that are given by an MA is most likely already confirmed.", 
            "Interpretation": "The 50 day SMA is in blue. The 200 day SMA is in green. The bull market support band (20 week SMA and 21 week EMA) is in yellow. The purple histogram is the volume. The larger the time frame, the stronger the support should be.",
            "Signals" : {
                "Price Crosses on MA": "A cross of price above an MA is bullish and shows that current price is above the longer term price movement. The opposite is bearish and shows that current price is behind long term price movement.",
                "MA Crosses": "A cross of a smaller MA over a larger MA is bullish and shows that short term price movement outrun long term price movement. A cross below is bearish and shows that recent prices are starting to lag behind.",
                "Golden / Death Cross": "A cross of the 50 day SMA above the 200 day SMA is a Golden Cross and is bullish. The cross below the 200 day SMA is a Death Cross is bearish.",
                "Bull Market Support Band": "Price movement above the Bull Market Support Band (20 week SMA and 21 week EMA) indicates a bull market, and a bear market below that."
            }
        },
        "Volatility": {
            "Description" : "The volatility of an asset's price shows how much it fluctuates within a certain day. Most assets measure this as percent movement from open to close, but since the crypto market is more volatile, this can also be measured from highs to lows.",
            "Notes" : "This is a custom made indicator, so its effectiveness is not tested or proven. This indicator is less effective with more volatile assets, where outliers will affect the overall chart.",
            "Interpretation": "The histogram will show the percent movement. There are boundary lines at 0, -/+10, -/+15, and -/+20. The blue line is a signal line that tracks general price movement.",
            "Signals" : {
                "Signal Line Above / Below Zero": "Signal line values above zero indicates an longer term uptrend, and the opposite indicates a downtrend.",
                "Signal Line Centerline Crosses":"Signal line crosses above the center line can indicate the start of an uptrend, and the opposite can indicate an upcoming downtrend.",
                "Flash Crashes / Pumps": "A dramatic movement above +10% can indicate a pump and a temporary top, and movement below -10% can be a flash crash and a temporary bottom."
            }
        },
        "RSI": {
            "Description" : "The relative strength index (RSI) is an oscillating momentum indicator that measures the magnitude of recent price changes to evaluate overbought or oversold conditions of an asset. ",
            "Interpretation": "The blue line is the RSI, which is range bound from 0 to 100. There are boundary lines at 20, 30, 50, 70, 80.",
            "Signals" : {
                "Overbought / Oversold Signals": "An RSI above 70 is overbought and extremely overbought at 80. Below 30 is oversold and extremely oversold below 20. Overbought signals indicate an upcoming top, and oversold signals indicate an upcoming bottom.",
                "Adjusted RSI Ranges": "RSI tends to stay within 40-100 in an uptrend, and 0-60 in a downtrend.",
                "Centerline Crosses": "A decisive break above 50 can confirm upward momentum, and a break below can confirm downward momentum.",
                "Divergences": "An uptrend in RSI and downtrend in price can signal an upcoming uptrend in price. The opposite can signal an upcoming downtrend in price. Divergences can be confirmed after a cross either above or below 50."
            }
        },
        "Stoch": {
            "Description" : "The Stochastic Oscillator (Stoch) is a momentum indicator that measures the close, relative to the high-low range over a period of time. The Stoch follows the speed or the momentum of price. As a rule, the momentum changes direction before price. Since Stoch is range-bound, it is also useful for identifying overbought and oversold levels. Stoch includes two lines, a more reactive line (%K) and less reactive line (%D), where the %D is a moving average of the %K.",
            "Notes":"Stoch tends to fluctuate greatly and give false signals, so any flag given must be confirmed with other indicators.",
            "Interpretation": "The blue line is the Stoch (%k) and the orange line is the signal line (%k). The signal line is derived from the stoch, and both are range bound from 0 to 100. There are boundary lines at 20, 30, 50, 70, 80",
            "Signals" : {
                "Overbought / Oversold Signals": "A Stoch above 70 is overbought and extremely overbought at 80. Below 30 is oversold and extremely oversold below 20. Overbought signals indicate an upcoming top, and oversold signals indicate an upcoming bottom.",
                "Signal Line Crosses": "A cross of the Stoch line below the signal line is an indicator for a top. A cross above the signal line is an indicator of a bottom.",
                "Divergences": "An uptrend in Stoch and downtrend in price can signal an upcoming uptrend in price. The opposite can signal an upcoming downtrend in price. Divergences can be confirmed after a cross either above or below 50."
            }
        },
        "StochRSI": {
            "Description" : "The Stochastic RSI (StochRSI) is an indicator created by applying the Stochastic oscillator formula to a set of relative strength index (RSI) values rather than to standard price data. The StochRSI oscillator was developed to take advantage of both momentum indicators in order to create a more sensitive indicator that is attuned to an asset’s historical performance rather than a generalized analysis of price change.",
            "Notes": "The StochRSI is a second derivative of price, and is further removed from true price movement, so any flags given must be confirmed with other indicators.",
            "Interpretation": "The blue line is the StochRSI, and the orange line is the signal line. Both are range boiund from 0 to 100. There are boundary lines at 20, 30, 50, 70, 80.",
            "Signals" : {
                "Overbought / Oversold Levels": "A StochRSI above 80 is overbought, and below 20 is oversold.",
                "Adjusted RSI Ranges": "StochRSI tends to stay within 0.4-1 in an uptrend, and 0-0.6 in a downtrend.",
                "Centerline Crosses": "A decisive break above 50 can confirm upward momentum, and a break below can confirm downward momentum."
            }
        },
        "MACD": {
            "Description" : "The Moving Average Convergence Divergence (MACD) is a momentum indicator, calculated by using Exponential Moving Averages (EMA) and used to assess the power of recent price movements. The MACD oscillates above and below a zero line, also known as the centerline. There are three indicators to watch: the MACD line (blue), the signal line (orange), and the MACD Histogram (purple).",
            "Notes" :  "MACD is not range bound, unlike most other indicators and oscillators, which means there are no oversold/bought levels.",
            "Interpretation": "The blue line is the MACD, and the orange line is the signal line. The histogram graphs MACD minus signal line.",
            "Signals" : {
                "Signal Line Crosses": "A cross of the MACD above the signal line is a buy signal and signals a potential bottom, and a cross below the signal line is a sell signal and signals a potential top.",
                "Signal Line Bounces": "A bounce of the MACD line on the signal line is a signal of an upcoming uptrend in price. Usually this happens at the end of a short term correction in a long term uptrend.",
                "Centerline Crosses": "A cross of the MACD above the centerline is a signal of an uptrend in price, and a cross below the centerline is a signal of a downtrend in price. This can also confirm price reversals.",
                "Divergences": "An uptrend in MACD and downtrend in price can signal an upcoming uptrend in price. The opposite trends can signal an upcoming downtrend in price.",
                "Histogram Movement": "Decreasing histogram values usually indicates a current downtrend, and increasing histogram values usually indicate a current uptrend. A histogram top can signal an upcoming downtrend in price, and a histogram bottom can signal an upcoming uptrend in price."
            }
        },
        "RVI": {
            "Description" : "The Relative Vigor Index (RVI) is a momentum indicator that pays more attention to the closing price, relative to the opening price, to measure strength and momentum. The RVI is based on the tendency for prices to close higher than they open during uptrends, and to close lower than they open in downtrends. The RVI is an oscillator that revolves around a zero centerline. The RVI line is in blue and the signal line is in orange.",
            "Note" : "While RVI is range bound, having an RVI value near the bounds has less meaning than other indicators. RVI is also a weaker indicator than the others, so this can only be used to confirm flags from other indicators.",
            "Interpretation": "The blue line is the RVI, and the orange line is the signal line. Both are range bound from -0.5 to 0.5. There is a boundary line at 0.",
            "Signals" : {
                "Signal Line Crosses": "A cross of the RVI above the signal line is bullish and a cross below the signal line is bearish.",
                "Congruent Trends": "An uptrend in both price and RVI is bullish and the downtrend of both RVI and price is bearish.",
                "Divergences": "An uptrend in RVI and a downtrend in price can be a signal of an upcoming uptrend in price. The opposite can signal an upcoming downtrend in price."
            }
        },
        "Fear And Greed": {
            "Description" : "The Fear And Greed Index is an indicator that measures overall sentiment in regards to the crypto market. Index scores closer to 0 indicate fear in the market, while scores near 100 indicate greed",
            "Note" : "The Fear and Greed Index is not related to any specific cryptocurrency, so all assets will have the same graph. This indicator is better suited for finding local bottoms than tops.",
            "Interpretation": "The blue line is the Fear and Greed Index, and it is range bound from 0 to 100. There are boundary lines at 15 and 85.",
            "Signals" : {
                "Overbought / Oversold Levels": "An index value over 85 is marked as extreme greed and is a sell signal. A value below 15 is extreme fear and is a buy signal. Extreme Fear is a stronger signal than extreme greed."
            }
        }
    }
}